### 재구조화

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('./data3/exam_sample.csv', encoding= 'euc-kr')
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_no  10 non-null     int64
 1   class       10 non-null     object
 2   science     10 non-null     int64
 3   english     10 non-null     int64
 4   math        10 non-null     int64
 5   sex         10 non-null     object
dtypes: int64(4), object(2)
memory usage: 608.0+ bytes

       student_no   science    english       math
count    10.00000  10.00000  10.000000  10.000000
mean      5.50000  53.90000  90.700000  56.500000
std       3.02765  24.09449   7.498889  23.810595
min       1.00000  15.00000  78.000000  20.000000
25%       3.25000  45.00000  86.750000  46.250000
50%       5.50000  54.00000  91.500000  50.000000
75%       7.75000  63.75000  97.750000  75.000000
max      10.00000  98.00000  98.000000  90.000000

### cut() = 특정데이터를 동일한 간격으로 구분할때 사용

In [8]:
print(df['math'].min())
print(df['math'].max())

20
90

In [14]:
# 최소값, 최대값을 기준으로 3구간으로 구분
pd.cut(df['math'], 3)

0    (43.333, 66.667]
1    (43.333, 66.667]
2    (43.333, 66.667]
3     (19.93, 43.333]
4      (66.667, 90.0]
5    (43.333, 66.667]
6      (66.667, 90.0]
7      (66.667, 90.0]
8     (19.93, 43.333]
9    (43.333, 66.667]
Name: math, dtype: category
Categories (3, interval[float64, right]): [(19.93, 43.333] < (43.333, 66.667] < (66.667, 90.0]]

In [17]:
# 해당 구간번호
df1 = pd.cut(df['math'], 3, labels=False)
df1

0    1
1    1
2    1
3    0
4    2
5    1
6    2
7    2
8    0
9    1
Name: math, dtype: int64

In [27]:
df2 = df['math'].groupby(df1)
df2.head(2)

0    50
1    60
3    30
4    90
6    80
8    20
Name: math, dtype: int64

In [30]:
df2.agg(['count','mean','std','min','max'])

      count       mean       std  min  max
math
0         2  25.000000  7.071068   20   30
1         5  51.000000  5.477226   45   60
2         3  86.666667  5.773503   80   90

### qcut() = 가까운 값 들끼리 나눔

In [33]:
pd.qcut(df['math'],5)

0      (42.0, 50.0]
1      (54.0, 82.0]
2      (42.0, 50.0]
3    (19.999, 42.0]
4      (82.0, 90.0]
5      (42.0, 50.0]
6      (54.0, 82.0]
7      (82.0, 90.0]
8    (19.999, 42.0]
9      (42.0, 50.0]
Name: math, dtype: category
Categories (5, interval[float64, right]): [(19.999, 42.0] < (42.0, 50.0] < (50.0, 54.0] < (54.0, 82.0] < (82.0, 90.0]]

In [36]:
pd.qcut(df['math'], 5, labels=False)

0    1
1    3
2    1
3    0
4    4
5    1
6    3
7    4
8    0
9    1
Name: math, dtype: int64